scripts/sart_500mL/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    outlet
    {
        type            patch;
        nFaces          1224;
        startFace       413328;
    }
    propeller
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          9672;
        startFace       414552;
    }
    walls
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          15072;
        startFace       424224;
    }
    inside_to_hub
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          0;
        startFace       439296;
    }
    inside_to_hub_copy
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          0;
        startFace       439296;
    }
    hub_to_rotor
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          0;
        startFace       439296;
    }
    hub_to_rotor_copy
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          0;
        startFace       439296;
    }
)

// ************************************************************************* //
