scripts/sart_500mL/0.org/k.gas
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      k.gas;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 3.7e-6;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    inlet
    {
        type        turbulentIntensityKineticEnergyInlet;
        intensity   0.05;
        value       $internalField;
        // Optional entries
        U           U.gas;
        phi         phi.gas;
    }

    outlet
    {
      type            inletOutlet;
      phi             phi.gas;
      inletValue      $internalField;
      value           $internalField;
    }

    walls
    {
        type            kqRWallFunction;
        value           $internalField;
    }
    propeller
    {
        type            kqRWallFunction;
        value           $internalField;
    }
}

// ************************************************************************* //
